aeroblade/templates/pritchard-cascade-2d/0/nut
FoamFile {version 2.0; format ascii; class volScalarField; object nut;}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField { cyclicLow {type cyclic;} cyclicHigh {type cyclic;} spanLow {type empty;} spanHigh {type empty;} inlet {type calculated; value uniform 0;} outlet {type calculated; value uniform 0;} blade {type nutkWallFunction; value uniform 0;} }
